

//Array of Objects

const quiz = [
    
    {
        q: "1. Термин «философия» происходит от греческого ... ",
        answer: 0,
        options: [
            { text: 'Любовь «phileo»,«sophia» мудрость,', img: '' },
            { text: 'Уважение к пониманию,', img: '' },
            { text: 'Мышление', img: '' },
            { text: 'Наука о человеке', img: '' }
        ]
    },
    {
        q: "2. Основатель термина «философия» ",
        answer: 0,
        options: [
            { text: 'Пифагор', img: '' },
            { text: 'Демакрит', img: '' },
            { text: 'Сократ', img: '' },
            { text: 'Платон', img: '' }
        ]
    },
    {
        q: "3. Выберите опцию, которая правильно соответствует исторической последовательности мировоззренческих форм",
        answer: 0,
        options: [
            { text: 'Мифологический, религиозный, философский, научный', img: '' },
            { text: 'Научная, философская, мифологическая, религиозная', img: '' },
            { text: 'Философская, религиозная, мифологическая, научная', img: '' },
            { text: 'Мифологическая, философская, научная, религиозная', img: '' }
        ]
    },
    {
        q: "4. Определите понятие, которое перевод обозначает сущность и основа",
        answer: 0,
        options: [
            { text: 'Субстанция', img: '' },
            { text: 'Материализм', img: '' },
            { text: 'Идеализм', img: '' },
            { text: 'Идеализм', img: '' }
        ]
    },
    {
        q: "5. Определите название направления, которое подчеркивает вещество как материал",
        answer: 0,
        options: [
            { text: 'Материализм', img: '' },
            { text: 'Идеализм', img: '' },
            { text: 'Геданизм', img: '' },
            { text: 'Аскетизм', img: '' }
        ]
    },
    {
        q: "6. Определите название направления, в котором оба, т.е.  материальное и духовное основание, считаются равными",
        answer: 0,
        options: [
            { text: 'Дуализм', img: '' },
            { text: 'Монизм', img: '' },
            { text: 'Сенсуализм', img: '' },
            { text: 'Плюрализм', img: '' }
        ]
    },
    {
        
        q: "7. Какова философская доктрина изучения бытия?",
        answer: 0,
        options: [
            { text: 'Онтология', img: '' },
            { text: 'Гносеология', img: '' },
            { text: 'Эпистимология', img: '' },
            { text: 'Социология', img: '' }
        ]
    },
    {
        
        q: "8. Определите название философского направления, ставящего под сомнение все научные взгляды. ",
        answer: 0,
        options: [
            { text: 'Скептицизм', img: '' },
            { text: 'Агностицизм', img: '' },
            { text: 'Метафизика', img: '' },
            { text: 'Диалектика', img: '' }
        ]
    },
    {
        q: "9. Что является предметом философии в широком смысле? ",
        answer: 0,
        options: [
            { text: 'Общие сущностные характеристики мира, отношение человека к природе и обществу ', img: '' },
            { text: 'Отношения с Богом или иным высшим существом ', img: '' },
            { text: 'Физическая реальность, ее характеристики', img: '' },
            { text: 'Отношения с Богом, физическая реальность', img: '' }
        ]
    },
    {
        q: "10. Что означает термин «философия»?",
        answer: 0,
        options: [
            { text: 'Любовь к мудрости ', img: '' },
            { text: 'Любовь к мышлению', img: '' },
            { text: 'Любовь к рассуждению', img: '' },
            { text: 'Любовь к познанию', img: '' }
        ]
    },
    {
        q: "11. Мировоззрение это - ",
        answer: 0,
        options: [
            { text: 'Система взглядов человека на мир в целом, свое место в мире, смысл жизни', img: '' },
            { text: 'Система взглядов групп людей, выражающая их интересы и отношение к социальной действительности', img: '' },
            { text: 'Система предпочтений зрелой личности', img: '' },
            { text: 'Система предпочтений групп людей', img: '' }
        ]
    },
    {
        q: "12. Какие философы являются основными представителями экзистенциализма?",
        answer: 0,
        options: [
            { text: 'Камю, Сартр, Кьеркегор', img: '' },
            { text: 'Сартр, Шпенглер, Шеллинг', img: '' },
            { text: 'Камю, Фрейд, Флоренский', img: '' },
            { text: 'Флоренский, Сартр, Шеллинг', img: '' }
        ]
    },
    {
        q: "13. Какой подраздел философии изучает нравственные ценности и моральные нормы?",
        answer: 0,
        options: [
            { text: 'Этика', img: '' },
            { text: 'Гносеология', img: '' },
            { text: 'Аксиология', img: '' },
            { text: 'Эстетика', img: '' }
        ]
    },
    {
        q: "14. Как формулируется основной вопрос философии?",
        answer: 0,
        options: [
            { text: 'Что первично: дух или материя?', img: '' },
            { text: 'Что такое добро и зло?', img: '' },
            { text: 'Каковы критерии определения истинного знания?', img: '' },
            { text: 'Каковы критерии определения материи?', img: '' }
        ]
    },
    {
        q: "15. Какая религиозная система являлась исходной для формирования философского мышления в Индии?",
        answer: 0,
        options: [
            { text: 'Брахманизм', img: '' },
            { text: 'Буддизм', img: '' },
            { text: 'Даосизм', img: '' },
            { text: 'Шаманизм', img: '' }
        ]
    },
    {
        q: "16. Какого закона диалектики Гегеля не существует?",
        answer: 0,
        options: [
            { text: 'Закон сохранения энергии', img: '' },
            { text: 'Закон отрицания отрицания', img: '' },
            { text: 'Закон единства противоположностей', img: '' },
            { text: 'Закон диалектики', img: '' }
        ]
    },
    {
        q: "17. Какой древнегреческий мыслитель считал, что главная задача состоит в самопознании?",
        answer: 0,
        options: [
            { text: 'Сократ', img: '' },
            { text: 'Платон', img: '' },
            { text: 'Аристотель', img: '' },
            { text: 'Плотин', img: '' }
        ]
    },
    {
        q: "18. Какой древнегреческий философ считал огонь основой всего?",
        answer: 0,
        options: [
            { text: 'Гераклит', img: '' },
            { text: 'Анаксимандр', img: '' },
            { text: 'Анаксимен', img: '' },
            { text: 'Платон', img: '' }
        ]
    },
    {
        q: "19. Как последователи буддизма формулируют первую «благородную» истину?",
        answer: 0,
        options: [
            { text: 'Бытие человек связано со страданием', img: '' },
            { text: 'У страдания есть причина', img: '' },
            { text: 'Есть путь, который помогает освободиться от страданий', img: '' },
            { text: 'Освободиться от страданий', img: '' }
        ]
    },
    {
        q: "20. Что было основной целью схоластики Средних Веков?",
        answer: 0,
        options: [
            { text: 'Защитить религию и ее истины', img: '' },
            { text: 'Проанализировать с точки зрения науки Библию', img: '' },
            { text: 'Опровергнуть наличие Бога', img: '' },
            { text: 'Проанализировать с точки зрения науки Тору', img: '' }
        ]
    },
    {
        q: "21. Какая форма бытия находится в центре проблематики экзистенциальной философии?",
        answer: 0,
        options: [
            { text: 'Бытие природы', img: '' },
            { text: 'Бытие общества', img: '' },
            { text: 'Индивидуальное бытие человека', img: '' },
            { text: 'Бытие материальное', img: '' }
        ]
    },
    {
        q: "22. Для идеализма характерно такое утверждение, как",
        answer: 0,
        options: [
            { text: 'Нельзя определить, что первично: материя или сознание', img: '' },
            { text: 'Первично сознание, материя независимо от него не существует', img: '' },
            { text: 'Первична материя, сознание не связано с ней', img: '' },
            { text: 'Первично сознание, сознание не связано с ней', img: '' }
        ]
    },
    {
        q: "23. Характерной чертой средневековой философии является",
        answer: 0,
        options: [
            { text: 'Господство теоцентризма', img: '' },
            { text: 'Баланс между теоцентризмом и сциентизмом', img: '' },
            { text: 'Наука', img: '' },
            { text: 'Философия', img: '' }
        ]
    },
    {
        q: "24. Философская концепция, согласно которой мир имеет единую основу, называется: ",
        answer: 0,
        options: [
            { text: 'Монизм', img: '' },
            { text: 'Релятивизм', img: '' },
            { text: 'Дуализм', img: '' },
            { text: 'Скептицизм', img: '' }
        ]
    },
    {
        q: "25. Согласно_________, мышление и бытие являются независимыми друг от друга субстанциями:",
        answer: 0,
        options: [
            { text: 'Дуализму', img: '' },
            { text: 'Идеализму', img: '' },
            { text: 'Материализму', img: '' },
            { text: 'Пантеизму', img: '' }
        ]
    },
    {
        q: "26. Устойчивая совокупность взглядов на мир, убеждений, установок, верований человека, определяющих выбор жизненной позиции, отношение к миру и другим людям – это:",
        answer: 0,
        options: [
            { text: 'Мировосприятие', img: '' },
            { text: 'Миропонимание', img: '' },
            { text: 'Мировоззрение', img: '' },
            { text: 'Мироощущение', img: '' }
        ]
    },
    {
        q: "27. Согласно данным науки, наиболее древней формой мировоззрения является:",
        answer: 0,
        options: [
            { text: 'Религия', img: '' },
            { text: 'Мифология', img: '' },
            { text: 'Философия', img: '' },
            { text: 'Наука', img: '' }
        ]
    },
    {
        q: "28. Термин «философия» был введен в научный оборот:",
        answer: 0,
        options: [
            { text: 'Гераклитом', img: '' },
            { text: 'Пифагором', img: '' },
            { text: 'Цицероном', img: '' },
            { text: 'Сократом', img: '' }
        ]
    },
    {
        q: "29. Раздел философии, изучающий фундаментальные принципы бытия – это:",
        answer: 0,
        options: [
            { text: 'Герменевтика', img: '' },
            { text: 'Онтология', img: '' },
            { text: 'Эсхатология', img: '' },
            { text: 'Социология', img: '' }
        ]
    },
    {
        q: "30. Ответы на философские вопросы ищут",
        answer: 0,
        options: [
            { text: 'В религиозных верованиях', img: '' },
            { text: 'В мифологических представлениях', img: '' },
            { text: 'В научных исследованиях', img: '' },
            { text: 'В доводах и заключениях разума', img: '' }
        ]
    },
    {
        q: "31. Кто из философов сформулировал три вопроса, выражающие, по его мнению, сущность философии: - Что я могу знать? Что я должен делать? На что я могу надеяться?",
        answer: 0,
        options: [
            { text: 'Аристотель', img: '' },
            { text: 'Г. Гегель', img: '' },
            { text: 'И. Кант', img: '' },
            { text: 'Фома Аквинский', img: '' }
        ]
    },
    {
        q: "32. Мир идей, согласно учению Платона, образует истинное бытие, существующее вне на3. А мир вещей – это вторичное и производное от него. Это положение выражает точку зрения",
        answer: 0,
        options: [
            { text: 'Антропологического материализма', img: '' },
            { text: 'Объективного идеализма', img: '' },
            { text: 'Субъективного идеализма', img: '' },
            { text: 'Диалектического материализма', img: '' }
        ]
    },
    {
        q: "33. Что в основании мира лежит одно начало считают:",
        answer: 0,
        options: [
            { text: 'Дуалисты', img: '' },
            { text: 'Монисты', img: '' },
            { text: 'Плюралисты', img: '' },
            { text: 'Агностики', img: '' }
        ]
    },
    {
        q: "34. Исходной истиной буддизма является утверждение, что",
        answer: 0,
        options: [
            { text: 'Жизнь есть радость и наслаждение', img: '' },
            { text: 'Жизнь есть страдание', img: '' },
            { text: 'Жизнь есть борьба', img: '' },
            { text: 'Жизнь есть форма существования белковой материи', img: '' }
        ]
    },
    {
        q: "35. Кому принадлежит высказывание: «Относись к людям так, как ты хотел бы, чтобы они относились к тебе»:",
        answer: 0,
        options: [
            { text: 'Лаю-цзы', img: '' },
            { text: 'Конфуцию', img: '' },
            { text: 'Вардхамане Махавире', img: '' },
            { text: 'Сиддхартхе Гаутаме', img: '' }
        ]
    },
    {
        q: "36. Кто из ранних греческих философов считал началом всего сущего воду?",
        answer: 0,
        options: [
            { text: 'Анаксимен', img: '' },
            { text: 'Фалес', img: '' },
            { text: 'Гераклит', img: '' },
            { text: 'Анаксимандр', img: '' }
        ]
    },
    {
        q: "37. Формула «Все есть число» является краеугольным камнем учения",
        answer: 0,
        options: [
            { text: 'Софистов', img: '' },
            { text: 'Стоиков', img: '' },
            { text: 'Скептиков', img: '' },
            { text: 'Пифагорейцев', img: '' }
        ]
    },
    {
        q: "38. Демокрит полагал началом всего сущего",
        answer: 0,
        options: [
            { text: 'атомы', img: '' },
            { text: 'огонь', img: '' },
            { text: 'числа', img: '' },
            { text: 'ум', img: '' }
        ]
    },
    {
        q: "39. Главная идея Гераклита, которая была проиллюстрирована им через образ реки:",
        answer: 0,
        options: [
            { text: '«все течет, все изменяется»', img: '' },
            { text: '«все полно богов»', img: '' },
            { text: '«все имеет начало и конец»', img: '' },
            { text: '«нет ничего в разуме, чего до этого не было бы в опыте»', img: '' }
        ]
    },
    {
        q: "40. Наиважнейшим принципом для Парменида является истина, что:",
        answer: 0,
        options: [
            { text: '«бытие есть, и небытие тоже есть»', img: '' },
            { text: '«человек есть мера всех вещей»', img: '' },
            { text: '«бытие есть, небытия нет»', img: '' },
            { text: '«в одну реку нельзя войти даже один раз»', img: '' }
        ]
    },
    {
        q: "41. Сократ говорил: \"Я знаю, что ничего не знаю, но...\"",
        answer: 0,
        options: [
            { text: 'Знания увеличивают скорбь', img: '' },
            { text: 'Попытаюсь узнать', img: '' },
            { text: 'Все знать и невозможно', img: '' },
            { text: 'Другие не знают и этого', img: '' }
        ]
    },
    {
        q: "42. Согласно Платону, познание это",
        answer: 0,
        options: [
            { text: 'Припоминание того, что душа уже знала всегда', img: '' },
            { text: 'Обобщение информации, полученной из опыта', img: '' },
            { text: 'Дальнейшее развитие знаний, накопленных предшествующими поколениями', img: '' },
            { text: 'Конструирование мира познающим субъектом', img: '' }
        ]
    },
    {
        q: "43. Согласно Платону, вещи – это",
        answer: 0,
        options: [
            { text: 'Копии идей', img: '' },
            { text: 'Сформованная материя', img: '' },
            { text: 'Устойчивые пучки восприятий', img: '' },
            { text: 'Продукты активности человеческого воображения', img: '' }
        ]
    },
    {
        q: "44. Один из жизненных императивов античной философии:",
        answer: 0,
        options: [
            { text: '«Познай самого себя»', img: '' },
            { text: '«Узнай как можно больше»', img: '' },
            { text: '«Следуй установленным правилам»', img: '' },
            { text: '«Надейся и жди»', img: '' }
        ]
    },
    {
        q: "45. Основная задача средневековой философии состояла в",
        answer: 0,
        options: [
            { text: 'Выработке методологической базы частных наук', img: '' },
            { text: 'Построении учения о душе', img: '' },
            { text: 'Защите веры, ответе на вопрос о существовании Бога', img: '' },
            { text: 'Обосновании идеи прекрасного', img: '' }
        ]
    },
    {
        q: "46. Среди философов средневековья можно выделить:",
        answer: 0,
        options: [
            { text: 'киников и эпикурейцев', img: '' },
            { text: 'идеалистов и материалистов', img: '' },
            { text: 'метафизиков и эмпириков', img: '' },
            { text: 'номиналистов и реалистов', img: '' }
        ]
    },
    { 
        q: "47. Доказательства бытия Бога разрабатывали представители:",
        answer: 0,
        options: [
            { text: 'логистики', img: '' },
            { text: 'софистики', img: '' },
            { text: 'майевтики', img: '' },
            { text: 'схоластики', img: '' }
        ]
    },
    {
        q: "48. Эпохой восстановления идеалов античности в Европе является",
        answer: 0,
        options: [
            { text: 'Средние века', img: '' },
            { text: 'Возрождение', img: '' },
            { text: 'Реформация', img: '' },
            { text: 'Просвещение', img: '' }
        ]
    },
    {
        q: "49. Характерной чертой Ренессанса является",
        answer: 0,
        options: [
            { text: 'теоцентризм', img: '' },
            { text: 'космоцентризм', img: '' },
            { text: 'антропоцентризм', img: '' },
            { text: 'наукоцентризм', img: '' }
        ]
    },
    {
        q: "50. Что сделал Коперник?",
        answer: 0,
        options: [
            { text: 'сформулировал законы механики', img: '' },
            { text: 'построил модель, согласно которой Земля вращается вокруг Солнца', img: '' },
            { text: 'доказал, что Земля круглая', img: '' },
            { text: 'предложил гипотезу формирования солнечной системы из пылевого облака', img: '' }
        ]
    },
    {
        q: "51. Родоначальником эмпиризма, как философского течения эпохи Нового времени является",
        options: [
            { text: 'Р. Декарт', img: '' },
            { text: 'Ф. Бэкон', img: '' },
            { text: 'И. Кант', img: '' },
            { text: 'Спиноза', img: '' }
        ]
    },
    {
        q: "52. Научный метод, сформулированный Ф. Бэконом, называется методом",
        answer: 0,
        options: [
            { text: 'Редукции', img: '' },
            { text: 'Абстракции', img: '' },
            { text: 'Дедукции', img: '' },
            { text: 'Индукции', img: '' }
        ]
    },
    {
        q: "53. Учение о дуализме субстанций развивал",
        answer: 0,
        options: [
            { text: 'Ф. Бэкон', img: '' },
            { text: 'Р. Декарт', img: '' },
            { text: '2. Спиноза', img: '' },
            { text: 'Т. Гоббс', img: '' }
        ]
    },
    {
        q: "54. Какое положение играет роль первой аксиомы в системе Р. Декарта:",
        answer: 0,
        options: [
            { text: '«страшусь, следовательно существую»', img: '' },
            { text: '«ощущаю, следовательно существую»', img: '' },
            { text: '«мыслю, следовательно существую»', img: '' },
            { text: '«говорю, следовательно существую»', img: '' }
        ]
    },
    {
        q: "55. Согласно Канту, «вещь в себе» это",
        answer: 0,
        options: [
            { text: 'замкнутый человек', img: '' },
            { text: 'вещь, данная нам на опыте', img: '' },
            { text: 'вещь, как она есть сама по себе, не зависимо от нашего восприятия', img: '' },
            { text: 'математическая конструкция', img: '' }
        ]
    },
    { 
        q: "56. В философии экзистенциализма под «экзистенцией» понимается",
        answer: 0,
        options: [
            { text: 'существование человека', img: '' },
            { text: 'сущность вещей', img: '' },
            { text: 'метод познания истины', img: '' },
            { text: 'общественный институт', img: '' }
        ]
    },
    {
        q: "57. Кто из философов утверждал, что жизнь человека в сущности бессмысленна и абсурдна?",
        answer: 0,
        options: [
            { text: 'К.Маркс', img: '' },
            { text: 'К. Поппер', img: '' },
            { text: 'Камю', img: '' },
            { text: 'З. Фрейд', img: '' }
        ]
    },
    {
        q: "58. Преувеличение относительности знания называется:",
        answer: 0,
        options: [
            { text: 'эмпиризмом', img: '' },
            { text: 'формализмом', img: '' },
            { text: 'релятивизмом', img: '' },
            { text: 'догматизмом', img: '' }
        ]
    },
    {
        q: "59. Что из нижеперечисленного не является формой чувственного познания?",
        answer: 0,
        options: [
            { text: 'ощущение', img: '' },
            { text: 'восприятие', img: '' },
            { text: 'представление', img: '' },
            { text: 'умозаключение', img: '' }
        ]
    },
    {
        q: "60. Основной формой рационального познания является:",
        answer: 0,
        options: [
            { text: 'индукция', img: '' },
            { text: 'понятие', img: '' },
            { text: 'представление', img: '' },
            { text: 'гипотеза', img: '' }
        ]
    },
    {
        q: "61. Мировоззренческая ориентация, возникшая в результате НТП и НТР, абсолютизирующая роль науки:",
        answer: 1,
        options: [
            { text: 'сциентизм', img: '' },
            { text: 'экологическое мировоззрение', img: '' },
            { text: 'фатализм', img: '' },
            { text: 'оптимизм', img: '' }
        ]
    },
    {
        q: "62. В философии не используют",
        answer: 0,
        options: [
            { text: 'метод', img: '' },
            { text: 'эксперимент', img: '' },
            { text: 'теорию', img: '' },
            { text: 'индукцию', img: '' }
        ]
    },
    {
        q: "63. Свойствами сознания не являются:",
        answer: 0,
        options: [
            { text: 'активность', img: '' },
            { text: 'интенциональность', img: '' },
            { text: 'материальность', img: '' },
            { text: 'рефлективность', img: '' }
        ]
    },
    {
        q: "64. В учении о познании признает приоритетным разум:",
        answer: 0,
        options: [
            { text: 'сенсуализм', img: '' },
            { text: 'агностицизм', img: '' },
            { text: 'рационализм', img: '' },
            { text: 'скептицизм', img: '' }
        ]
    },
    { 
        q: "65. Вид познания, основанный, прежде всего, на интуиции и здравом смысле:",
        answer: 0,
        options: [
            { text: 'научное', img: '' },
            { text: 'повседневное', img: '' },
            { text: 'художественное', img: '' },
            { text: 'философское', img: '' }
        ]
    },
    {
        q: "66. «Нет ничего в разуме, чего до этого не было бы в опыте». Эта фраза выражает позицию",
        answer: 0,
        options: [
            { text: 'Эмпирика', img: '' },
            { text: 'Рационализм', img: '' },
            { text: 'Солипсизм', img: '' },
            { text: 'Иррационализм', img: '' }
        ]
    },
    {
        q: "67. Источник познания – это воспоминание души о мире идей, полагал:",
        answer: 0,
        options: [
            { text: 'Платон', img: '' },
            { text: 'Сократ', img: '' },
            { text: 'Аристотель', img: '' },
            { text: 'Декарт', img: '' }
        ]
    },
    { 
        q: "68. Философ, ученик Платона:",
        answer: 0,
        options: [
            { text: 'Аристотель', img: '' },
            { text: 'Сократ', img: '' },
            { text: 'Пифагор', img: '' },
            { text: 'Зенон', img: '' }
        ]
    },
    {
        q: "69. Характерной чертой средневековой философии является:",
        answer: 0,
        options: [
            { text: 'Теоцентризм', img: '' },
            { text: 'Капитализм', img: '' },
            { text: 'Социализм', img: '' },
            { text: 'Антропоцентризм', img: '' }
        ]
    },
    {
        q: "70. Представитель философии эпохи Возрождения:",
        answer: 0,
        options: [
            { text: 'Дж.Бруно', img: '' },
            { text: 'Гегель', img: '' },
            { text: 'Кант', img: '' },
            { text: 'Гёте', img: '' }
        ]
    },
    {
        q: "71. Раздел философии, изучающий фундаментальные принципы бытия:",
        answer: 0,
        options: [
            { text: 'герменевтика', img: '' },
            { text: 'онтология', img: '' },
            { text: 'эсхатология', img: '' },
            { text: 'социология', img: '' }
        ]
    },
    {
        q: "72. Раздел философии, который рассматривает поступки и отношения между людьми с точки зрения представлений о добре и зле:",
        answer: 0,
        options: [
            { text: 'этика', img: '' },
            { text: 'эстетика', img: '' },
            { text: 'прагматика', img: '' },
            { text: 'гносеология', img: '' }
        ]
    },
    {
        q: "73. Что в основании мира лежит одно начало считают:",
        answer: 0,
        options: [
            { text: 'дуалисты', img: '' },
            { text: 'монисты', img: '' },
            { text: 'плюралисты', img: '' },
            { text: 'агностики', img: '' }
        ]
    },
    {
        q: "74. Философское учение о всеобщих законах познания — это:",
        answer: 0,
        options: [
            { text: 'гносеология', img: '' },
            { text: 'онтология', img: '' },
            { text: 'эстетика', img: '' },
            { text: 'этика', img: '' }
        ]
    },
    {
        q: "75. Философское учение о природе, структуре и взаимоотношениях ценностей— это:",
        answer: 0,
        options: [
            { text: 'гносеология', img: '' },
            { text: 'онтология', img: '' },
            { text: 'аксиология', img: '' },
            { text: 'этика', img: '' }
        ]
    },
    {
        q: "76. Понятие «Нирвана» характерно для следующей древнеиндийской философской школы:",
        answer: 0,
        options: [
            { text: 'чарвака-локаята', img: '' },
            { text: 'джайнизм', img: '' },
            { text: 'буддизм', img: '' },
            { text: 'веданта', img: '' }
        ]
    },
    {
        q: "77. Назовите китайского философа, который считается основателем даосизма:",
        answer: 0,
        options: [
            { text: 'Конфуций', img: '' },
            { text: 'Мо-цзы,5', img: '' },
            { text: 'Лао-цзы', img: '' },
            { text: 'Чжун-цзы', img: '' }
        ]
    },
    {
        q: "78. Конфуций полагал, что благодаря свой деятельной природе, человек занимает центральное место в универсуме, потому что:",
        answer: 0,
        options: [
            { text: 'способен изменять сущность вещей', img: '' },
            { text: 'разделяет враждебные начала – Небо и Землю', img: '' },
            { text: 'поддерживает равновесие мировых основ', img: '' },
            { text: 'создан, чтобы покорять Природу', img: '' }
        ]
    },
    {
        q: "79. Понятие «жень» означает:",
        answer: 0,
        options: [
            { text: 'эгоизм', img: '' },
            { text: 'безразличие', img: '' },
            { text: 'человеколюбие', img: '' },
            { text: 'мизантропия', img: '' }
        ]
    },
    {
        q: "80. Философия родилась через преодоление",
        answer: 0,
        options: [
            { text: 'религии', img: '' },
            { text: 'эпоса', img: '' },
            { text: 'магии', img: '' },
            { text: 'мифа', img: '' }
        ]
    },
    {
        q: "81. Анаксимандр считал первоосновой всего:",
        answer: 0,
        options: [
            { text: 'число', img: '' },
            { text: 'огонь', img: '' },
            { text: 'воду', img: '' },
            { text: 'апейрон', img: '' }
        ]
    },
    {
        q: "82. Анаксимен считал первоосновой всего сущего:",
        answer: 0,
        options: [
            { text: 'число', img: '' },
            { text: 'огонь', img: '' },
            { text: 'воду', img: '' },
            { text: 'воздух', img: '' }
        ]
    },
    {
        q: "83. «Человек – мера всех вещей», так считал",
        answer: 0,
        options: [
            { text: 'Аристотель', img: '' },
            { text: 'Сократ', img: '' },
            { text: 'Протагор', img: '' },
            { text: 'Эпикур', img: '' }
        ]
    },
    {
        q: "84. Сократ говорил: \"Я знаю, что ничего не знаю, но...\"",
        answer: 0,
        options: [
            { text: 'знания увеличиваю скорбь', img: '' },
            { text: 'попытаюсь узнать', img: '' },
            { text: 'все знать и невозможно', img: '' },
            { text: 'другие не знают и этого', img: '' }
        ]
    },
    {
        q: "85. Главной проблемой, которая интересовала Сократа, был вопрос:",
        answer: 0,
        options: [
            { text: 'о Боге', img: '' },
            { text: 'о мире', img: '' },
            { text: 'об истории', img: '' },
            { text: 'о человеке', img: '' }
        ]
    },
    { 
        q: "86. Античный философ, создавший логику:",
        answer: 0,
        options: [
            { text: 'Сократ', img: '' },
            { text: 'Платон', img: '' },
            { text: 'Аристотель', img: '' },
            { text: 'Демокрит', img: '' }
        ]
    },
    {
        q: "87. Перводвигатель, согласно Аристотелю, - это:",
        answer: 0,
        options: [
            { text: 'логическая категория', img: '' },
            { text: 'политическая организация', img: '' },
            { text: 'причина всякого движения в мире', img: '' },
            { text: 'человеческий индивид', img: '' }
        ]
    },
    {
        q: "88. Важнейшей чертой философского мировоззрения в эпоху Средневековья признается:",
        answer: 0,
        options: [
            { text: 'космоцентризм', img: '' },
            { text: 'наукоцентризм', img: '' },
            { text: 'теоцентризм', img: '' },
            { text: 'антропоцентризм', img: '' }
        ]
    },
    {
        q: "89. Теоцентризм – мировоззренческая позиция, в основе которой лежит представление о главенстве:",
        answer: 0,
        options: [
            { text: 'человека', img: '' },
            { text: 'природы', img: '' },
            { text: 'бога', img: '' },
            { text: 'науки', img: '' }
        ]
    },
    {
        q: "90. Доказательства бытия Бога разрабатывали представители:",
        answer: 0,
        options: [
            { text: 'логистики', img: '' },
            { text: 'софистики', img: '' },
            { text: 'майевтики', img: '' },
            { text: 'схоластики', img: '' }
        ]
    },
    {
        q: "91. Эпохой восстановления идеалов античности в Европе является:",
        answer: 0,
        options: [
            { text: 'Средние века', img: '' },
            { text: 'Возрождение', img: '' },
            { text: 'Реформация', img: '' },
            { text: 'Просвещение', img: '' }
        ]
    },
    {
        q: "92. Характерной чертой Ренессанса является:",
        answer: 0,
        options: [
            { text: 'Теоцентризм', img: '' },
            { text: 'Космоцентризм', img: '' },
            { text: 'Антропоцентризм', img: '' },
            { text: 'Наукоцентризм', img: '' }
        ]
    },
    {
        q: "93. Укажите на специфическую черту натурфилософии эпохи Возрождения:",
        answer: 0,
        options: [
            { text: 'атеизм', img: '' },
            { text: 'дуализм', img: '' },
            { text: 'пантеизм', img: '' },
            { text: 'плюрализм', img: '' }
        ]
    },
    {
        q: "94. Какому философскому направлению соответствует высказывание «В интеллекте нет ничего, чего бы не было в чувствах»:",
        answer: 1,
        options: [
            { text: 'эмпиризм', img: '' },
            { text: 'рационализм', img: '' },
            { text: 'агностицизм', img: '' },
            { text: 'иррационализм', img: '' }
        ]
    },
    {
        q: "95. Родоначальником французского рационализма и автором произведения \"Рассуждение о методе\" является:",
        answer: 0,
        options: [
            { text: 'М. Вольтер', img: '' },
            { text: 'Рене Декарт', img: '' },
            { text: 'Ж. Руссо', img: '' },
            { text: 'Дидро', img: '' }
        ]
    },
    {
        q: "96. Утверждение свободы человеческого существования, предполагающей выбор человеком собственной сущности, характерно для:",
        options: [
            { text: 'персонализма', img: '' },
            { text: 'экзистенциализма', img: '' },
            { text: 'постмодернизма', img: '' },
            { text: 'марксизма', img: '' }
        ]
    },
    {
        q: "97. Преувеличение относительности знания называется:",
        answer: 0,
        options: [
            { text: 'эмпиризмом', img: '' },
            { text: 'формализмом', img: '' },
            { text: 'релятивизмом', img: '' },
            { text: 'догматизмом', img: '' }
        ]
    },
    {
        q: "98. В онтологическом аспекте противоположным термину «рационализм» выступает понятие:",
        answer: 0,
        options: [
            { text: 'иррационализм', img: '' },
            { text: 'эмпиризм', img: '' },
            { text: 'солипсизм', img: '' },
            { text: 'материализм', img: '' }
        ]
    },
    {
        q: "99. С позиции _______________, сознание есть независимое от материального бытия царство идей, чувств, воли, способное творить и конструировать действительность:",
        answer: 0,
        options: [
            { text: 'материализма', img: '' },
            { text: 'идеализма', img: '' },
            { text: 'дуализма', img: '' },
            { text: 'реализма', img: '' }
        ]
    },
    {
        q: "100. Источник познания – это воспоминание души о мире идей, полагал:",
        answer: 0,
        options: [
            { text: 'Платон', img: '' },
            { text: 'Сократ', img: '' },
            { text: 'Аристотель', img: '' },
            { text: 'Декарт', img: '' }
        ]
    }
];